backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_image, 0, 0]
  - [input_image_meta, 0, 0]
  - [input_anchors, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, 3]
      dtype: float32
      name: input_image
      sparse: false
    inbound_nodes: []
    name: input_image
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: zero_padding2d_5
      padding: !!python/tuple
      - !!python/tuple [3, 3]
      - !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - input_image
        - 0
        - 0
        - {}
    name: zero_padding2d_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_5
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn_conv1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {training: false}
    name: bn_conv1
  - class_name: Activation
    config: {activation: relu, name: activation_297, trainable: true}
    inbound_nodes:
    - - - bn_conv1
        - 0
        - 0
        - {}
    name: activation_297
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_297
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple [1, 1]
      name: res2a_branch2a
      padding: valid
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: res2a_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2a
        - 0
        - 0
        - {training: false}
    name: bn2a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_298, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2a
        - 0
        - 0
        - {}
    name: activation_298
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2a_branch2b
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_298
        - 0
        - 0
        - {}
    name: res2a_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2b
        - 0
        - 0
        - {training: false}
    name: bn2a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_299, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2b
        - 0
        - 0
        - {}
    name: activation_299
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple [1, 1]
      name: res2a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_299
        - 0
        - 0
        - {}
    name: res2a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [1, 1]
      name: res2a_branch1
      padding: valid
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: res2a_branch1
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2c
        - 0
        - 0
        - {training: false}
    name: bn2a_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch1
        - 0
        - 0
        - {training: false}
    name: bn2a_branch1
  - class_name: Add
    config: {name: add_133, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2c
        - 0
        - 0
        - &id004 {}
      - - bn2a_branch1
        - 0
        - 0
        - *id004
    name: add_133
  - class_name: Activation
    config: {activation: relu, name: res2a_out, trainable: true}
    inbound_nodes:
    - - - add_133
        - 0
        - 0
        - {}
    name: res2a_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: res2b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res2a_out
        - 0
        - 0
        - {}
    name: res2b_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2a
        - 0
        - 0
        - {training: false}
    name: bn2b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_300, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2a
        - 0
        - 0
        - {}
    name: activation_300
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_300
        - 0
        - 0
        - {}
    name: res2b_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2b
        - 0
        - 0
        - {training: false}
    name: bn2b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_301, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2b
        - 0
        - 0
        - {}
    name: activation_301
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id007 !!python/tuple [1, 1]
      name: res2b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_301
        - 0
        - 0
        - {}
    name: res2b_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2c
        - 0
        - 0
        - {training: false}
    name: bn2b_branch2c
  - class_name: Add
    config: {name: add_134, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2c
        - 0
        - 0
        - &id005 {}
      - - res2a_out
        - 0
        - 0
        - *id005
    name: add_134
  - class_name: Activation
    config: {activation: relu, name: res2b_out, trainable: true}
    inbound_nodes:
    - - - add_134
        - 0
        - 0
        - {}
    name: res2b_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res2c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res2b_out
        - 0
        - 0
        - {}
    name: res2c_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2a
        - 0
        - 0
        - {training: false}
    name: bn2c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_302, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2a
        - 0
        - 0
        - {}
    name: activation_302
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_302
        - 0
        - 0
        - {}
    name: res2c_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2b
        - 0
        - 0
        - {training: false}
    name: bn2c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_303, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2b
        - 0
        - 0
        - {}
    name: activation_303
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res2c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_303
        - 0
        - 0
        - {}
    name: res2c_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2c
        - 0
        - 0
        - {training: false}
    name: bn2c_branch2c
  - class_name: Add
    config: {name: add_135, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2c
        - 0
        - 0
        - &id008 {}
      - - res2b_out
        - 0
        - 0
        - *id008
    name: add_135
  - class_name: Activation
    config: {activation: relu, name: res2c_out, trainable: true}
    inbound_nodes:
    - - - add_135
        - 0
        - 0
        - {}
    name: res2c_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res3a_branch2a
      padding: valid
      strides: &id012 !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res2c_out
        - 0
        - 0
        - {}
    name: res3a_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2a
        - 0
        - 0
        - {training: false}
    name: bn3a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_304, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2a
        - 0
        - 0
        - {}
    name: activation_304
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_304
        - 0
        - 0
        - {}
    name: res3a_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2b
        - 0
        - 0
        - {training: false}
    name: bn3a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_305, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2b
        - 0
        - 0
        - {}
    name: activation_305
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res3a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_305
        - 0
        - 0
        - {}
    name: res3a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res3a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res2c_out
        - 0
        - 0
        - {}
    name: res3a_branch1
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2c
        - 0
        - 0
        - {training: false}
    name: bn3a_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch1
        - 0
        - 0
        - {training: false}
    name: bn3a_branch1
  - class_name: Add
    config: {name: add_136, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2c
        - 0
        - 0
        - &id013 {}
      - - bn3a_branch1
        - 0
        - 0
        - *id013
    name: add_136
  - class_name: Activation
    config: {activation: relu, name: res3a_out, trainable: true}
    inbound_nodes:
    - - - add_136
        - 0
        - 0
        - {}
    name: res3a_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res3a_out
        - 0
        - 0
        - {}
    name: res3b_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2a
        - 0
        - 0
        - {training: false}
    name: bn3b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_306, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2a
        - 0
        - 0
        - {}
    name: activation_306
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_306
        - 0
        - 0
        - {}
    name: res3b_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2b
        - 0
        - 0
        - {training: false}
    name: bn3b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_307, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2b
        - 0
        - 0
        - {}
    name: activation_307
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_307
        - 0
        - 0
        - {}
    name: res3b_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2c
        - 0
        - 0
        - {training: false}
    name: bn3b_branch2c
  - class_name: Add
    config: {name: add_137, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2c
        - 0
        - 0
        - &id014 {}
      - - res3a_out
        - 0
        - 0
        - *id014
    name: add_137
  - class_name: Activation
    config: {activation: relu, name: res3b_out, trainable: true}
    inbound_nodes:
    - - - add_137
        - 0
        - 0
        - {}
    name: res3b_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res3b_out
        - 0
        - 0
        - {}
    name: res3c_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2a
        - 0
        - 0
        - {training: false}
    name: bn3c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_308, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2a
        - 0
        - 0
        - {}
    name: activation_308
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_308
        - 0
        - 0
        - {}
    name: res3c_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2b
        - 0
        - 0
        - {training: false}
    name: bn3c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_309, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2b
        - 0
        - 0
        - {}
    name: activation_309
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_309
        - 0
        - 0
        - {}
    name: res3c_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2c
        - 0
        - 0
        - {training: false}
    name: bn3c_branch2c
  - class_name: Add
    config: {name: add_138, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2c
        - 0
        - 0
        - &id015 {}
      - - res3b_out
        - 0
        - 0
        - *id015
    name: add_138
  - class_name: Activation
    config: {activation: relu, name: res3c_out, trainable: true}
    inbound_nodes:
    - - - add_138
        - 0
        - 0
        - {}
    name: res3c_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3d_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res3c_out
        - 0
        - 0
        - {}
    name: res3d_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2a
        - 0
        - 0
        - {training: false}
    name: bn3d_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_310, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2a
        - 0
        - 0
        - {}
    name: activation_310
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3d_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_310
        - 0
        - 0
        - {}
    name: res3d_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2b
        - 0
        - 0
        - {training: false}
    name: bn3d_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_311, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2b
        - 0
        - 0
        - {}
    name: activation_311
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3d_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_311
        - 0
        - 0
        - {}
    name: res3d_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2c
        - 0
        - 0
        - {training: false}
    name: bn3d_branch2c
  - class_name: Add
    config: {name: add_139, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2c
        - 0
        - 0
        - &id016 {}
      - - res3c_out
        - 0
        - 0
        - *id016
    name: add_139
  - class_name: Activation
    config: {activation: relu, name: res3d_out, trainable: true}
    inbound_nodes:
    - - - add_139
        - 0
        - 0
        - {}
    name: res3d_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res4a_branch2a
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res3d_out
        - 0
        - 0
        - {}
    name: res4a_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2a
        - 0
        - 0
        - {training: false}
    name: bn4a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_312, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2a
        - 0
        - 0
        - {}
    name: activation_312
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res4a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_312
        - 0
        - 0
        - {}
    name: res4a_branch2b
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2b
        - 0
        - 0
        - {training: false}
    name: bn4a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_313, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2b
        - 0
        - 0
        - {}
    name: activation_313
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res4a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_313
        - 0
        - 0
        - {}
    name: res4a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res4a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res3d_out
        - 0
        - 0
        - {}
    name: res4a_branch1
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2c
        - 0
        - 0
        - {training: false}
    name: bn4a_branch2c
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch1
        - 0
        - 0
        - {training: false}
    name: bn4a_branch1
  - class_name: Add
    config: {name: add_140, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2c
        - 0
        - 0
        - &id017 {}
      - - bn4a_branch1
        - 0
        - 0
        - *id017
    name: add_140
  - class_name: Activation
    config: {activation: relu, name: res4a_out, trainable: true}
    inbound_nodes:
    - - - add_140
        - 0
        - 0
        - {}
    name: res4a_out
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res4b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - res4a_out
        - 0
        - 0
        - {}
    name: res4b_branch2a
  - class_name: BatchNorm
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
